---
kind: property
id: P:Autodesk.Revit.DB.Visual.Marble.TextureRealWorldOffsetY
source: html/d2803421-2a90-3810-20d8-df1326916340.htm
---
# Autodesk.Revit.DB.Visual.Marble.TextureRealWorldOffsetY Property

The property labeled "Offset Y" from the "Marble" schema.

## Syntax (C#)
```csharp
public static string TextureRealWorldOffsetY { get; }
```

## Remarks
This property is of type "AssetPropertyDistance".